---
kind: property
id: P:Autodesk.Revit.DB.TextNote.TextNoteType
zh: 注释、文字注释
source: html/e0b08dfc-834c-6dbf-c66c-fc640860d36f.htm
---
# Autodesk.Revit.DB.TextNote.TextNoteType Property

**中文**: 注释、文字注释

Access the type of the TextNote object.

## Syntax (C#)
```csharp
public TextNoteType TextNoteType { get; set; }
```

## Remarks
The type of the TextNote object can be retrieved or changed.